In [13]:
import pandas as pd

emp_data = {'id':[1,7,11,90,3],
            'name':['Alice','Bob','Meir','Winston','Jonathan']}
uni_data = {'id':[3,11,90],
            'unique_id':[1,2,3]}

emp_data = {'id':[1,7,11,90,3],
            'name':['Alice','Bob','Meir','Winston','Jonathan']}
uni_data = {'id':[3,11,90,10],
            'unique_id':[101,102,103,104]}

employees = pd.DataFrame(emp_data)
employee_uni = pd.DataFrame(uni_data)

In [19]:
all_df = pd.merge(employees,employee_uni,on='id',how='outer').dropna(subset=['name'])
all_df = all_df.drop(columns=['id'])
all_df['unique_id'] = all_df['unique_id'].astype('Int64')
all_df = all_df[['unique_id','name']]
all_df

   unique_id      name
0       <NA>     Alice
1        101  Jonathan
2       <NA>       Bob
4        102      Meir
5        103   Winston